# A) Define Data Analytics? Explain variable, measurement and data. Why data is important?

# B) Write a Python code to perform following array operations using numpy library.
Arrays: A=[1,2,3,4,5], B=[6,7,8,9,10]
<ul>
    <li>Perform basic arithmetic operations on two arrays</li>
    <li>Find min, max, square root, exponential of given array elements</li>
    <li>Find mean, exp, std deviation of given array</li>
    </ul>

<h1>A)</h1>
<b>Data Analytics: </b> <i>Scientific process of transforming data into insights for making better decisions<i>
   <p>It's of 4 types <ul>
    <li>Descriptive</li>
    <li>Diagosnitc</li>
    <li>predictive</li>
    <li>Prescreptive</li>
    </ul>
   </p>
<img src="https://i0.wp.com/tommarch.com/wp-content/uploads/2020/01/Data-Analytics.001-1.jpeg?ssl=1" height="600" width="600"/>

In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [8]:
A=np.array([1,2,3,4,5])
B=np.array([6,7,8,9,10])
# Basic operations
print("add = ", A+B)
print("sub = ", A-B)
print("mul = ", A+B)
print("div = ", A+B, "\n")
# Find min, max, square root, exponential of given array elements
print("min = ", np.min(A))
print("max = ", np.max(A))
print("square root = ", np.sqrt(A))
print("exp = ", np.exp(A), "\n")
# Find mean, exp, std deviation of given array
print("mean = ", np.mean(A))
print("exp = ", np.exp(A))
print("std = ", np.std(A))

add =  [ 7  9 11 13 15]
sub =  [-5 -5 -5 -5 -5]
mul =  [ 7  9 11 13 15]
div =  [ 7  9 11 13 15]

min =  1
max =  5
square root =  [1.         1.41421356 1.73205081 2.         2.23606798]
exp =  [  2.71828183   7.3890561   20.08553692  54.59815003 148.4131591 ]

mean =  3.0
exp =  [  2.71828183   7.3890561   20.08553692  54.59815003 148.4131591 ]
std =  1.4142135623730951

## Question-2
<h3>
      A) What are the different functions used for data cleaning using pandas in
      python?
    </h3>
    <h3>
      B) Implement a program to do Data Cleaning and Data Manipulation
      Operations on the dataset â€˜datasetExample.csv'. Perform following
      operations:
    </h3>
    <ul>
      <li>Identify the datatype of each column</li>
      <li>Check and remove all duplicate records</li>
      <li>Check and remove all duplicate columns</li>
    </ul>

<h3>A)</h3>
df.isnull() and df.notnull()<br>
df.dropna()  # Drop rows with any NaN values<br>
df.dropna(axis=1)  # Drop columns with any NaN values
df.fillna(0)  # Replace NaN values with 0<br>
df['column'].fillna(df['column'].mean())  # Replace NaN with the mean of the column<br>
df.apply(np.sqrt)<br>
df['column'].apply(lambda x: x**2)

In [10]:
df = pd.read_csv("datasetExample.csv")
df

,CustomerID,Age_Group,Rating(1-5),Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary,Age_Group.1
0,1,20-25,4,Ibis,veg,1300,2,40000,20-25
1,2,30-35,5,Lemon Tree,Non-veg,2000,3,59000,30-35
2,3,25-30,6,RedFox,Veg,1322,2,30000,25-30
3,4,20-25,-1,Lemon Tree,Veg,1234,2,120000,20-25
4,5,35+,3,Ibis,Vegetarian,989,2,45000,35+
5,6,35+,3,Ibys,Non-veg,1909,2,122220,35+
6,7,35+,4,RedFox,Vegetarian,1000,-1,21122,35+
7,8,20-25,7,Lemon Tree,Veg,2999,-10,345673,20-25
8,9,25-30,2,Ibis,Non-veg,3456,3,-99999,25-30
9,9,25-30,2,Ibis,Non-veg,3456,3,-99999,25-30
10,10,30-35,5,RedFox,non-veg,-6755,4,87777,30-35

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   CustomerID           11 non-null     int64
 1   Age_Group            11 non-null     object
 2   Rating(1-5)          11 non-null     int64
 3   Hotel                11 non-null     object
 4   FoodPreference       11 non-null     object
 5   Bill                 11 non-null     int64
 6   NoOfPax              11 non-null     int64
 7   EstimatedSalary      11 non-null     int64
 8   Age_Group.1          11 non-null     object
dtypes: int64(5), object(4)
memory usage: 920.0+ bytes

In [15]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
dtype: bool

In [23]:
df.drop_duplicates(inplace=True)

In [24]:
dfn = df.T.drop_duplicates()
dfn.T

,CustomerID,Age_Group,Rating(1-5),Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary
0,1,20-25,4,Ibis,veg,1300,2,40000
1,2,30-35,5,Lemon Tree,Non-veg,2000,3,59000
2,3,25-30,6,RedFox,Veg,1322,2,30000
3,4,20-25,-1,Lemon Tree,Veg,1234,2,120000
4,5,35+,3,Ibis,Vegetarian,989,2,45000
5,6,35+,3,Ibys,Non-veg,1909,2,122220
6,7,35+,4,RedFox,Vegetarian,1000,-1,21122
7,8,20-25,7,Lemon Tree,Veg,2999,-10,345673
8,9,25-30,2,Ibis,Non-veg,3456,3,-99999
10,10,30-35,5,RedFox,non-veg,-6755,4,87777

<h1>Question-3</h1>
    <h2>A) How to work with missing data in python?</h2>
    <h2>
      B) Write a Python code to perform Data pre-processing task on given
      dataset 'pre-process_datasample.csv' (eg. Checking and Handling Missing
      Data, handling inappropriate data)
      <ul>
        <li>Checking and Handling Missing Data on all Columns</li>
        <li>Identify Null values in a column</li>
        <li>Handle missing values</li>
        <li>Check and Handle Categorical Columns</li>
      </ul>
    </h2>

<h1>A)</h1>
we can work with missing data in many ways but most common approaches are
    i)Removing Missing Data ii)Modifying The Missing Data we can modify the data
    by replacing the missing value, with it's central tendency, such as mean,
    median, mode this depends on whether the data is nominal, ordinal, interval
    or ratio we can choose either filling the missing data with measure of
    central tendency or use ffill or bfill or use Imputation i.e fillna()

In [26]:
df2 = pd.read_csv("pre-process_datasample.csv")
df2

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8      NaN  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [27]:
df2.isna().any()

Country       True
Age           True
Salary        True
Purchased    False
dtype: bool